Documents/КпкЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>КпкЗаявка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваровУПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>eXiteАдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>eXiteСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.eXiteСостояние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUI_77</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Comment>Торговый агент документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГПСДолгота</Name>
					<Comment>Долгота</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГПСШирота</Name>
					<Comment>Широта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КпкВремяСоздания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КпкДатаСоздания</Name>
					<Comment>Дата создания документа в КПК</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутРазвоза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыРазвоза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКомментария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флПерсЦены</Name>
					<Comment>Признак использования персональных цен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флСертификаты</Name>
					<Comment>Клиенту требуются сертификаты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераПачек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецЗаказ</Name>
					<Comment>Это спец. заказ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КД_КатегорииТТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзменено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРекомендовано</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_СуммаИндикатив</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_ЦенаИндикатив</Name>
							<Comment>Цена индикатив</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена без скидки</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказанное</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПриоритета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КД_ТипыПриоритетовПродукта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Планирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОтрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентВыравнивания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентРекомендуемогоЗапаса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КратностьУпаковки</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продажи</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОтрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемыйЗаказ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемыйЗапас</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажиСреднееНеделя</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажиСпецЗаказ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОтрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КпкЗаявка/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборПодразделение = Настройки.Получить("ОтборПодразделение");
	ОтборМаршрут = Настройки.Получить("ОтборМаршрут");
	ОтборМенеджер = Настройки.Получить("ОтборМенеджер");
	
	УправлениеНебольшойФирмойСервер.ИзменитьЭлементОтбораСписка(Список, "Подразделение", ОтборПодразделение, ЗначениеЗаполнено(ОтборПодразделение));
	УправлениеНебольшойФирмойСервер.ИзменитьЭлементОтбораСписка(Список, "МаршрутРазвоза", ОтборМаршрут, ЗначениеЗаполнено(ОтборМаршрут));
	УправлениеНебольшойФирмойСервер.ИзменитьЭлементОтбораСписка(Список, "Менеджер", ОтборМенеджер, ЗначениеЗаполнено(ОтборМенеджер));
	
	ОбновлениеИнформацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(Список, "Подразделение", ОтборПодразделение, ЗначениеЗаполнено(ОтборПодразделение));
	ОбновлениеИнформацииСервер();

КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(Список, "МаршрутРазвоза", ОтборМаршрут, ЗначениеЗаполнено(ОтборМаршрут));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(Список, "Менеджер", ОтборМенеджер, ЗначениеЗаполнено(ОтборМенеджер));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокМаршрутовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Маршрут) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОкончания = Элементы.список.Период.ДатаОкончания;
	Если ДатаОкончания = '0001-01-01' Тогда
		ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	УсловияОтбора = Новый Структура("НачалоПериода, КонецПериода, МаршрутРазвоза", ДатаОкончания - 7 * 24 * 60 * 60, ДатаОкончания, Элемент.ТекущиеДанные.Маршрут);
	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	
	ОткрытьФорму("Отчет.ВедомостьПоРазвозу.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область ДействияКоманд

&НаКлиенте
Процедура АвтоЗаполнениеМаршрутов(Команда)
	
	// Обязательная проверка - "ОтборПодразделение"
	Если Не ЗначениеЗаполнено(ОтборПодразделение) Тогда
		
		Предупреждение(НСтр("ru = 'Установите отбор по подразделению'"));
		Возврат;
		
	КонецЕсли;
	
	Если ПериодАвтозаполнения = '00010101' Тогда
		
		ПериодАвтозаполнения = ТекущаяДата();
		Предупреждение(НСтр("ru = 'Укажите дату для автозаполнения.'"));
		
		Возврат;
		
	КонецЕсли;
	
	АвтоЗаполнениеМаршрутовСервер();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМенеджеровИМаршруты(Команда)
	
	// Обновим данные таблиц: "Менеджеры" и "Маршруты"
	ОбновлениеИнформацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаявку(Команда)
	
	ЗначениеМаршрутРазвоза = ОткрытьФормуМодально("Справочник.МаршрутыРазвоза.ФормаВыбора",);
	
	Если ЗначениеМаршрутРазвоза = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМаршрут(Элементы.Список.ВыделенныеСтроки, ЗначениеМаршрутРазвоза);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьМаршруты(Команда)
	
	// Обязательная проверка - "ОтборПодразделение"
	Если Не ЗначениеЗаполнено(ОтборПодразделение) Тогда
		
		Предупреждение(НСтр("ru = 'Установите отбор по подразделению'"));
		Возврат;
		
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = НСтр("ru = 'ВНИМАНИЕ! Все маршруты за выбранный период будут очищены.'");
	Ответ = Вопрос(Текст, Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	// Вставить содержимое обработчика.
	ОчиститьМаршрутыСервер();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	МаршрутРазвоза = Элементы.СписокМаршрутов.ТекущиеДанные.Маршрут;
	
	Если Не ЗначениеЗаполнено(МаршрутРазвоза) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОкончания = Элементы.список.Период.ДатаОкончания;
	Если ДатаОкончания = '0001-01-01' Тогда
		ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	УсловияОтбора = Новый Структура("НачалоПериода, КонецПериода, МаршрутРазвоза", ДатаОкончания - 7 * 24 * 60 * 60, ДатаОкончания, МаршрутРазвоза);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	
	ОткрытьФорму("Отчет.ВедомостьПоРазвозу.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявки(Команда)
	
	МаршрутРазвоза = Элементы.СписокМаршрутов.ТекущиеДанные.Маршрут;
	
	Если Не ЗначениеЗаполнено(МаршрутРазвоза) Тогда
		Возврат;
	КонецЕсли;

	ДатаОкончания = Элементы.список.Период.ДатаОкончания;
	Если ДатаОкончания = '0001-01-01' Тогда
		ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	УсловияОтбора = Новый Структура("МаршрутРазвоза", МаршрутРазвоза);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	
	ОткрытьФорму("Отчет.Заявки.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЯрлыки(Команда)
		
	МаршрутРазвоза = Элементы.СписокМаршрутов.ТекущиеДанные.Маршрут;
	
	Если Не ЗначениеЗаполнено(МаршрутРазвоза) Тогда
		Возврат;
	КонецЕсли;

	ДатаОкончания = Элементы.список.Период.ДатаОкончания;
	Если ДатаОкончания = '0001-01-01' Тогда
		ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	ДатаНачала = Элементы.список.Период.ДатаНачала;
	Если ДатаНачала = '0001-01-01' Тогда
		ДатаНачала = НачалоДня(ДатаОкончания);
	КонецЕсли;
	
	УсловияОтбора = Новый Структура("НачалоПериода, КонецПериода, МаршрутРазвоза", ДатаНачала, ДатаОкончания, МаршрутРазвоза);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	
	ОткрытьФорму("Отчет.Ярлыки.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервере
Процедура УстановитьМаршрут(Знач ДанныеДляОбработки, ЗначениеМаршрутРазвоза)
	
	Если ДанныеДляОбработки <> Неопределено Тогда
		
		Для каждого ТекущиеДанные Из ДанныеДляОбработки Цикл
			
			Если ЗначениеЗаполнено(ТекущиеДанные) И (Не ТекущиеДанные.МаршрутРазвоза = ЗначениеМаршрутРазвоза) Тогда
				
				Объект = ТекущиеДанные.ПолучитьОбъект();
				Объект.МаршрутРазвоза = ЗначениеМаршрутРазвоза;
				Объект.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеИнформацииСервер()
	
	Если (Элементы.Список.Период.ДатаНачала = '00010101') Тогда
		НачалоПериода = НачалоДня(ТекущаяДата());
	Иначе
		НачалоПериода = Элементы.Список.Период.ДатаНачала;
	КонецЕсли;
	
	Если (Элементы.Список.Период.ДатаОкончания = '00010101') Тогда
		ОкончаниеПериода = КонецДня(ТекущаяДата());
	Иначе
		ОкончаниеПериода = Элементы.Список.Период.ДатаОкончания;
	КонецЕсли;
	
	Если ОкончаниеПериода < НачалоПериода Тогда
		
		НачалоПериода = НачалоДня(НачалоПериода);
		ОкончаниеПериода = КонецДня(НачалоПериода);
		
	КонецЕсли;
	
	Элементы.Группа3Итоги.Заголовок = "(" + ПредставлениеПериода(НачалоПериода,ОкончаниеПериода, "ДФ=dd.MM.yy") + ")";
	
	// Параметры запроса
	УстановитьПараметрДинамическогоСписка(СписокМенеджеров, "Подразделение", 		ОтборПодразделение);
	УстановитьПараметрДинамическогоСписка(СписокМенеджеров, "ОтборПодразделение",	ЗначениеЗаполнено(ОтборПодразделение));
	УстановитьПараметрДинамическогоСписка(СписокМенеджеров, "НачалоПериода", 		НачалоПериода);
	УстановитьПараметрДинамическогоСписка(СписокМенеджеров, "ОкончаниеПериода", 	ОкончаниеПериода);
	
	УстановитьПараметрДинамическогоСписка(СписокМаршрутов, "Подразделение", 		ОтборПодразделение);
	УстановитьПараметрДинамическогоСписка(СписокМаршрутов, "ОтборПодразделение",	ЗначениеЗаполнено(ОтборПодразделение));
	УстановитьПараметрДинамическогоСписка(СписокМаршрутов, "НачалоПериода", 		НачалоПериода);
	УстановитьПараметрДинамическогоСписка(СписокМаршрутов, "ОкончаниеПериода", 		ОкончаниеПериода);

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КпкЗаявка.Ссылка) КАК Колво,
	|	СУММА(КпкЗаявка.Количество * КпкЗаявка.Номенклатура.Вес) КАК Вес
	|ИЗ
	|	Документ.КпкЗаявка.Запасы КАК КпкЗаявка
	|ГДЕ
	|	КпкЗаявка.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И КпкЗаявка.Ссылка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И ВЫБОР
	|			КОГДА &ОтборПодразделение
	|				ТОГДА КпкЗаявка.Ссылка.Подразделение = &Подразделение
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтборПодразделение", ЗначениеЗаполнено(ОтборПодразделение));
	Запрос.УстановитьПараметр("Подразделение", ОтборПодразделение);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Элементы.ВсегоВес = 0;
		Элементы.ВсегоЗаявок = 0;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ВсегоВес = Выборка.Вес;
		ВсегоЗаявок = Выборка.Колво;
		
	КонецЕсли;				   
		
КонецПроцедуры

// Устанавливает значение параметра динамического списка на сервере
//
// Параметры:
// ДинамическийСписок - динамический список, для которого устанавливается параметр
// Имя - имя параметра динамического списка
// ЗначениеПараметра - значение устанавливаемого параметра
//
&НаСервере
Процедура УстановитьПараметрДинамическогоСписка(ДинамическийСписок, Имя, ЗначениеПараметра)
	
	Если Не ДинамическийСписок.Параметры.Элементы.Найти(Имя) = Неопределено Тогда
		ДинамическийСписок.Параметры.УстановитьЗначениеПараметра(Имя, ЗначениеПараметра);
	КонецЕсли;
	
КонецПроцедуры // УстановитьПараметрДинамическогоСписка()

&НаСервере
Процедура АвтоЗаполнениеМаршрутовСервер()
	
	Если (Элементы.Список.Период.ДатаНачала = '00010101') Тогда
		НачалоПериода = НачалоДня(ТекущаяДата());
	Иначе
		НачалоПериода = Элементы.Список.Период.ДатаНачала;
	КонецЕсли;
	
	Если (Элементы.Список.Период.ДатаОкончания = '00010101') Тогда
		ОкончаниеПериода = КонецДня(ТекущаяДата());
	Иначе
		ОкончаниеПериода = Элементы.Список.Период.ДатаОкончания;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КпкЗаявка.Ссылка,
	|	ЕСТЬNULL(КпкЗаявкаДляАнализа.МаршрутРазвоза, ЗНАЧЕНИЕ(Справочник.МаршрутыРазвоза.ПустойМаршрут)) КАК МаршрутРазвоза
	|ИЗ
	|	Документ.КпкЗаявка КАК КпкЗаявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КпкЗаявка КАК КпкЗаявкаДляАнализа
	|		ПО КпкЗаявка.Контрагент = КпкЗаявкаДляАнализа.Контрагент
	|ГДЕ
	|	КпкЗаявкаДляАнализа.Дата МЕЖДУ &НачалоПериодаАнализа И &ОкончаниеПериодаАнализа
	|	И КпкЗаявкаДляАнализа.Проведен = ИСТИНА
	|	И КпкЗаявка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И КпкЗаявка.Проведен = ИСТИНА
	|	И КпкЗаявка.МаршрутРазвоза = ЗНАЧЕНИЕ(Справочник.МаршрутыРазвоза.ПустойМаршрут)
	|	И КпкЗаявка.Подразделение = &Подразделение";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("НачалоПериодаАнализа", НачалоДня(ПериодАвтозаполнения));
	Запрос.УстановитьПараметр("ОкончаниеПериодаАнализа", КонецДня(ПериодАвтозаполнения));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Подразделение", ОтборПодразделение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.МаршрутРазвоза = Выборка.МаршрутРазвоза;
		ДокументОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьМаршрутыСервер()
	
	Если (Элементы.Список.Период.ДатаНачала = '00010101') Тогда
		НачалоПериода = НачалоДня(ТекущаяДата());
	Иначе
		НачалоПериода = Элементы.Список.Период.ДатаНачала;
	КонецЕсли;
	
	Если (Элементы.Список.Период.ДатаОкончания = '00010101') Тогда
		ОкончаниеПериода = КонецДня(ТекущаяДата());
	Иначе
		ОкончаниеПериода = Элементы.Список.Период.ДатаОкончания;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КпкЗаявка.Ссылка
	|ИЗ
	|	Документ.КпкЗаявка КАК КпкЗаявка
	|ГДЕ
	|	КпкЗаявка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И КпкЗаявка.Проведен = ИСТИНА
	|	И КпкЗаявка.Подразделение = &Подразделение";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Подразделение", ОтборПодразделение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.МаршрутРазвоза = Справочники.МаршрутыРазвоза.ПустойМаршрут;
		ДокументОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
